In [1]:
import pandas as pd

#creating a dataframe
df = pd.DataFrame({'Name': ['John', 'Emma', 'David', 'Sophia'],
        'Age': [25, 28, 31, 24],
        'City': ['New York', 'London', 'Paris', 'Sydney']})

df

     Name  Age      City
0    John   25  New York
1    Emma   28    London
2   David   31     Paris
3  Sophia   24    Sydney

### Q) What is Pandas and it's use?

* Pandas is a open-source Python library use for data manipulation and data analysis. 

It's use:-

1) We can handle structure data in form of tables in pandas. 


2) We can perform many data manipulation and data analysis tasks using pandas, such as dropping column, checking the null values in the data and fill it, check the skewness of a particular variable, check data types of all columns and many more things we can perfrom using pandas library.


3) Pandas library is widely used in data science, finance, and many other fields for data analysis and data manipulation tasks.

### Q) You have a DataFrame in Pandas columns, how to make a new column between 2nd and 3rd column?


* We using df.insert() function and the code will be df.inseri(index no. of column, 'column name', variable of new column values).

In [2]:
# By using df.insert() function
# Format df.insert(index, 'new column name', Variable of new column values)

Sex = ['M', 'F', 'M', 'F']

df.insert(2, 'Sex', Sex)

df

     Name  Age Sex      City
0    John   25   M  New York
1    Emma   28   F    London
2   David   31   M     Paris
3  Sophia   24   F    Sydney

### Q) How to delete a column and add a new ones in it's index position?

In [3]:
df.drop('City',axis=1,inplace=True)

Location = ['delhi', 'mumbai', 'kolkata', 'chennai']

df.insert(3, 'Address', Location)

df

     Name  Age Sex  Address
0    John   25   M    delhi
1    Emma   28   F   mumbai
2   David   31   M  kolkata
3  Sophia   24   F  chennai

### Q) What is the use of inplace=True parameter.

* inplace is a inbuild parameter in pandas which is used to manipulate the original dataset directly. For eg: we write a code that df.drop('column name', axis=1, inplace=True), which means it will drop that column permantly even in the original dataset.

### Q) What is Pivot Table?

* Pivot table is a type of customize table where we can customize the index, columns and data inside the table by taking original data of original dataset. It is use for data anlayis and data summarization. In pivot table we can use aggregation functions, such as count, sum, mean and median.

### Q) How to find null values?

* By using df.isnull().sum()

### Q) How to drop a column in pandas?

* We use df.drop('column name', axis = 1, inplace = True)

### Q) How to compute mode in pamdas?
* By using df.mode() function, it will give mode of every column.

### Q) How to compute variance & standard deviation in pandas?

By using df.var() function we compute variance of all columns and by using df.std() function we compute standard deviation of all columns.

### Q) How to compute covariance and correlation in pandas?

* By using df.cov() function it will compute covariance and by using using df.corr('pearson') it will compute Pearson's coefficient Correlation and by using df.corr('spearman') it will compute Spearman's rank correlation.